[
  {
    "id": "math-roast",
    "name": "Math Roast Game",
    "metadata": {
      "title": "Play Math Roast Game Online Free | Solve math problems fast and get roasted for incorrect answers | Edurance Hub",
      "description": "Play Math Roast Game online for free. Solve math problems fast and get roasted for incorrect answers. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "math roast game, play math roast game online, free math roast game, online math roast game, free game, online game, edurance hub, solve game",
      "url": "https://edurancehub.com/games/math-roast"
    }
  },
  {
    "id": "typing-speed",
    "name": "Typing Speed Test",
    "metadata": {
      "title": "Play Typing Speed Test Online Free | Test your typing speed and accuracy with this challenging game | Edurance Hub",
      "description": "Play Typing Speed Test online for free. Test your typing speed and accuracy with this challenging game. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "typing speed test, play typing speed test online, free typing speed test, online typing speed test, free game, online game, edurance hub, test game",
      "url": "https://edurancehub.com/games/typing-speed"
    }
  },
  {
    "id": "tic-tac-toe",
    "name": "Tic Tac Toe",
    "metadata": {
      "title": "Play Tic Tac Toe Online Free | Classic X and O game with player vs player and computer modes | Edurance Hub",
      "description": "Play Tic Tac Toe online for free. Classic X and O game with player vs player and computer modes. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "tic tac toe, play tic tac toe online, free tic tac toe, online tic tac toe, free game, online game, edurance hub, classic game",
      "url": "https://edurancehub.com/games/tic-tac-toe"
    }
  },
  {
    "id": "rock-paper-scissors",
    "name": "Rock Paper Scissors",
    "metadata": {
      "title": "Play Rock Paper Scissors Online Free | Classic hand game of strategy and luck against computer | Edurance Hub",
      "description": "Play Rock Paper Scissors online for free. Classic hand game of strategy and luck against computer. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "rock paper scissors, play rock paper scissors online, free rock paper scissors, online rock paper scissors, free game, online game, edurance hub, classic game",
      "url": "https://edurancehub.com/games/rock-paper-scissors"
    }
  },
  {
    "id": "snake",
    "name": "Snake Game",
    "metadata": {
      "title": "Play Snake Game Online Free | Classic snake game with modern design and smooth controls | Edurance Hub",
      "description": "Play Snake Game online for free. Classic snake game with modern design and smooth controls. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "snake game, play snake game online, free snake game, online snake game, free game, online game, edurance hub, classic game",
      "url": "https://edurancehub.com/games/snake"
    }
  },
  {
    "id": "memory-flip",
    "name": "Memory Flip Game",
    "metadata": {
      "title": "Play Memory Flip Game Online Free | Test your memory with card matching challenges | Edurance Hub",
      "description": "Play Memory Flip Game online for free. Test your memory with card matching challenges. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "memory flip game, play memory flip game online, free memory flip game, online memory flip game, free game, online game, edurance hub, test game",
      "url": "https://edurancehub.com/games/memory-flip"
    }
  },
  {
    "id": "word-scramble",
    "name": "Word Scramble",
    "metadata": {
      "title": "Play Word Scramble Online Free | Unscramble letters to form the correct words in this puzzle game | Edurance Hub",
      "description": "Play Word Scramble online for free. Unscramble letters to form the correct words in this puzzle game. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "word scramble, play word scramble online, free word scramble, online word scramble, free game, online game, edurance hub, unscramble game",
      "url": "https://edurancehub.com/games/word-scramble"
    }
  },
  {
    "id": "pong-2d",
    "name": "Pong 2D",
    "metadata": {
      "title": "Play Pong 2D Online Free | Retro table tennis arcade game with modern enhancements | Edurance Hub",
      "description": "Play Pong 2D online for free. Retro table tennis arcade game with modern enhancements. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "pong 2d, play pong 2d online, free pong 2d, online pong 2d, free game, online game, edurance hub, retro game",
      "url": "https://edurancehub.com/games/pong-2d"
    }
  },
  {
    "id": "hangman",
    "name": "Hangman Game",
    "metadata": {
      "title": "Play Hangman Game Online Free | Classic word guessing game with a twist and multiple categories | Edurance Hub",
      "description": "Play Hangman Game online for free. Classic word guessing game with a twist and multiple categories. Enjoy this fun game with modern design. No signup required. Part of Edurance Hub's collection of free online games.",
      "keywords": "hangman game, play hangman game online, free hangman game, online hangman game, free game, online game, edurance hub, classic game",
      "url": "https://edurancehub.com/games/hangman"
    }
  }
]